src/cf/Catalogs/ЗадачиАссистентаПоЗадачамСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗадачиАссистентаПоЗадачамСотрудника</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправления</Name>
					<Comment>8 - интервал 8-12, 12- интервал 12-16, 16 - интервал 16-20</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбщегоОбсуждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимоПоприветствовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролируемыйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательДляОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОповещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОповещенияАссистентаУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролируемыйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарьОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарьСотрудникСотрудники</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбсуждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтролируемыеСотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/СотрудникиПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияОткрытийЗадачПользователями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОткрытийЗадачПользователями</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОткрытияЗадачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗадачаСотрудника</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ЗадачаСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗадачаСотрудника</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолонкаКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КолонкиКалендарейСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадачи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеСтроковаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесьДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТегиЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/ЗадачиАссистентаПоЗадачамСотрудника/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает Истина, если есть включенные задачи по напоминаниям о записи
// 
// Возвращаемое значение:
//  Булево
//
Функция ЕстьЗадачиВРаботеПросроченные() Экспорт
	
	МассивИдентификаторов = Новый Массив;
	МассивИдентификаторов.Добавить("ОповеститьСотрудникаОПросроченныхЗадачахПоEmail");
	МассивИдентификаторов.Добавить("ОповеститьСотрудникаОПросроченныхЗадачахВОбсуждении");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗадачиАссистентаПоЗадачамСотрудника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЗадачиАссистентаПоЗадачамСотрудника КАК ЗадачиАссистентаПоЗадачамСотрудника
	|ГДЕ
	|	НЕ ЗадачиАссистентаПоЗадачамСотрудника.ПометкаУдаления
	|	И ЗадачиАссистентаПоЗадачамСотрудника.Используется
	|	И ЗадачиАссистентаПоЗадачамСотрудника.Идентификатор В (&МассивИдентификаторов)";
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции

// Есть задачи в работе статус.
// 
// Возвращаемое значение:
//  Булево - Есть задачи в работе
Функция ЕстьЗадачиВРаботеСтатус() Экспорт

	МассивИдентификаторов = Новый Массив;
	МассивИдентификаторов.Добавить("ОповеститьСотрудникаОСтатусеЗадачВОбсуждении");
	МассивИдентификаторов.Добавить("ОповеститьСотрудникаОСтатусеЗадачПоEmail");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗадачиАссистентаПоЗадачамСотрудника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЗадачиАссистентаПоЗадачамСотрудника КАК ЗадачиАссистентаПоЗадачамСотрудника
	|ГДЕ
	|	НЕ ЗадачиАссистентаПоЗадачамСотрудника.ПометкаУдаления
	|	И ЗадачиАссистентаПоЗадачамСотрудника.Используется
	|	И ЗадачиАссистентаПоЗадачамСотрудника.Идентификатор В (&МассивИдентификаторов)";
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);	
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции

// Получить массив активных задач сотрудника.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.Сотрудники -  Сотрудник
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.ЗадачаСотрудника - массив активных задач сотрудника
Функция ПолучитьМассивАктивныхЗадачСотрудника(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗадачаСотрудника.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
	|ГДЕ
	|	ЗадачаСотрудника.Ответственный = &Сотрудник
	|	И ЗадачаСотрудника.ПометкаУдаления = ЛОЖЬ
	|	И ЗадачаСотрудника.Выполнена = ЛОЖЬ"; 
 	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции         

// Получить массив просроченных задач сотрудника.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.Сотрудники -  Сотрудник
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.ЗадачаСотрудника - массив просроченных задач сотрудника
Функция ПолучитьМассивПросроченныхЗадачСотрудника(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗадачаСотрудника.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
	|ГДЕ
	|	ЗадачаСотрудника.Ответственный = &Сотрудник
	|	И ЗадачаСотрудника.ДатаНачала <> &ПустаяДата
	|	И ЗадачаСотрудника.ДатаОкончания <> &ПустаяДата
	|	И ЗадачаСотрудника.ПометкаУдаления = ЛОЖЬ
	|	И ЗадачаСотрудника.Выполнена = ЛОЖЬ
	|	И ЗадачаСотрудника.ДатаОкончания < &ТекДата";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции  

// Получить массив новых задач сотрудника.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.Сотрудники -  Сотрудник
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.ЗадачаСотрудника - массив новых задач сотрудника
Функция ПолучитьМассивНовыхЗадачСотрудника(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗадачаСотрудника.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
	|ГДЕ
	|	ЗадачаСотрудника.Ответственный = &Сотрудник
	|	И ЗадачаСотрудника.Дата >= &ДатаВчера
	|	И ЗадачаСотрудника.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ДатаВчера", НачалоДня(НачалоДня(ТекущаяДатаСеанса())-1));

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Получить массив выполненных задач сотрудника.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.Сотрудники -  Сотрудник
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.ЗадачаСотрудника - массив выполненных задач сотрудника
Функция ПолучитьМассивВыполненныхЗадачСотрудника(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗадачаСотрудника.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
	|ГДЕ
	|	ЗадачаСотрудника.Ответственный = &Сотрудник
	|	И ЗадачаСотрудника.Выполнена = ИСТИНА
	|	И ЗадачаСотрудника.ДатаВыполнения >= &ДатаВчера
	|	И ЗадачаСотрудника.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ДатаВчера", НачалоДня(НачалоДня(ТекущаяДатаСеанса())-1));

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Получить массив неоткрытых задач сотрудника.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.Сотрудники -  Сотрудник
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.ЗадачаСотрудника - массив неоткрытых задач сотрудника
Функция ПолучитьМассивНеоткрытыхЗадачСотрудника(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗадачаСотрудника.Ссылка КАК Задача,
	|	ЗадачаСотрудника.Ответственный КАК Ответственный,
	|	СотрудникиПользователя.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ втПользователиСотрудника
	|ИЗ
	|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
	|		ПО ЗадачаСотрудника.Ответственный = СотрудникиПользователя.Сотрудник
	|ГДЕ
	|	ЗадачаСотрудника.Ответственный = &Сотрудник
	|	И ЗадачаСотрудника.ПометкаУдаления = ЛОЖЬ
	|	И ЗадачаСотрудника.ДатаПоследнегоИзменения <> &ПустаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втПользователиСотрудника.Задача КАК Ссылка
	|ИЗ
	|	втПользователиСотрудника КАК втПользователиСотрудника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияОткрытийЗадачПользователями КАК ИсторияОткрытийЗадачПользователями
	|		ПО втПользователиСотрудника.Задача = ИсторияОткрытийЗадачПользователями.Задача
	|			И втПользователиСотрудника.Пользователь = ИсторияОткрытийЗадачПользователями.Пользователь
	|ГДЕ
	|	ИсторияОткрытийЗадачПользователями.ДатаОткрытияЗадачи ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Сотрудник",  Сотрудник);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));	                           

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции    

// Получить массив приближающихся задач сотрудника.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.Сотрудники -  Сотрудник
// 
// Возвращаемое значение:
//  Массив из  ДокументСсылка.ЗадачаСотрудника - массив приближающихся задач сотрудника
Функция ПолучитьМассивПриближающихсяЗадачСотрудника(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗадачаСотрудника.Ответственный КАК Ответственный,
	|	ЗадачаСотрудника.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
	|ГДЕ
	|	ЗадачаСотрудника.Ответственный = &Сотрудник
	|	И ЗадачаСотрудника.ДатаНачала <> &ПустаяДата
	|	И ЗадачаСотрудника.ПометкаУдаления = ЛОЖЬ
	|	И ЗадачаСотрудника.ДатаНачала >= &ДатаСегодня
	|	И ЗадачаСотрудника.ДатаНачала <= &КонецДня";
	Запрос.УстановитьПараметр("Сотрудник",  Сотрудник);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));	                           
	Запрос.УстановитьПараметр("ДатаСегодня", НачалоДня(ТекущаяДатаСеанса()));	                           
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекущаяДатаСеанса()));	                           

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗапланироватьЗадачиКВыполнению(НовыеЗадачиКВыполнению, ВыбранныеЗадачиАссистента) Экспорт
	
	СекундВЧасе = 3600;
	СекундВСутках = 86400;
	ВремяОтправленияЗадач = НачалоДня(ТекущаяДатаСеанса()) + СекундВСутках + ВремяОтправленияЗадач() * СекундВЧасе;
	
	Для каждого ЗадачаАссистента Из ВыбранныеЗадачиАссистента Цикл
		НоваяЗадача = НовыеЗадачиКВыполнению.Добавить();
		НоваяЗадача.Дата = ВремяОтправленияЗадач;
		НоваяЗадача.Задача = ЗадачаАссистента; 
	КонецЦикла;
	
КонецПроцедуры

Процедура ПоприветствоватьПользователяПриЗаписиПервыхЗадач(ЗадачиАссистента) Экспорт
	
	АссистентПодключен = АссистентУправления.Подключен();
	Если Не АссистентПодключен Тогда
		АссистентУправления.Подключить();
	КонецЕсли;
	
	Для каждого ЗадачаАссистента Из ЗадачиАссистента Цикл
		ЗадачаОбъект = ЗадачаАссистента.ПолучитьОбъект();
		ЗадачаОбъект.ПоприветствоватьПользователяПередПервымВыполнением();
	КонецЦикла;
	
КонецПроцедуры

Функция ВремяОтправленияЗадач() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗадачиАссистентаПоЗадачамСотрудника.ВремяОтправления КАК ВремяОтправления
	|ИЗ
	|	Справочник.ЗадачиАссистентаПоЗадачамСотрудника КАК ЗадачиАссистентаПоЗадачамСотрудника";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеЗадачи = Результат.Выбрать();
	ДанныеЗадачи.Следующий();
	Возврат ДанныеЗадачи.ВремяОтправления;
	
КонецФункции

#КонецОбласти

#КонецЕсли
